[{"subtopic": "Whole Numbers", "patterns": ["Round 324 456 to the nearest hundred. ", "What is the missing number in the box? ", "What is the missing number in the box? ", "The average age of 3 dogs was 12 years old. The age of each dog was different. The youngest dog was 8 years old. Which one of the following was a possible age of the oldest dog?", "Tom and Jerry took a 10-minute Mathematics quiz. They started and ended the quiz at the same time. Tom answered 2 questions more than Jerry for every minute. Together, they answered 58 questions. How many questions did Jerry answer?", "Ella wrote her composition in 45 minutes. Fandi completed his composition 5 minutes faster than Ella. Ella wrote an average of 24 words per minute. Their compositions had a total of 2000 words. What was the average number of words Fandi wrote per minute?"]}, {"subtopic": "Money", "patterns": ["Debbie bought a calculator and a printer at Great Store. She was given a 10% discount for both items. How much did she pay for both items?", "Chandra bought 7 stamps at n cents each. He paid with a five-dollar note. How much change did he receive? "]}, {"subtopic": "Fractions", "patterns": ["The area of A is 5 times the area of C. The area of B is 1 2/5 times the area of A. Express the area of A as a fraction of the whole figure.", "A baker made 225 fewer cheese buns than kaya buns. He sold half of the cheese buns and 7/9 of the kaya buns. There were 128 buns left in the end. How many buns did he sell? ", "Arrange these fractions in descending order. ", "Express 7 3/25 as a decimal. ", "Mr Loh planted 120 pots of orchids and roses. 3/5 of the pots were orchids. Among the roses, there was an equal number of pots of red and pots of yellow roses. How many pots of yellow roses were there? ", "Mr Loh buys 10kg of rice. He packs 2/5 of the rice into smaller bags. The mass of each smaller bag of rice 1/4 kg. How many smaller bags of rice are there? ", "The ratio of Amal's money to Bill's money is 5:3. Amal spends 1/3 of her money. What is the new ratio of Bill's money to Amal's remaining money? ", "A baker made 225 fewer cheese buns than kaya buns. He sold half of the cheese buns and 7/9 of the kaya buns. There were 128 buns left in the end. How many buns did he sell? ", "The area of A is 5 times the area of C. The area of B is 1 2/5 times the area of A. Express the area of A as a fraction of the whole figure.", "Mr Loh buys 10kg of rice. He packs 2/5 of the rice into smaller bags. The mass of each smaller bag of rice 1/4 kg. How many smaller bags of rice are there? ", "A baker made 225 fewer cheese buns than kaya buns. He sold half of the cheese buns and 7/9 of the kaya buns. There were 128 buns left in the end. How many buns did he sell? "]}, {"subtopic": "Decimals", "patterns": ["Express 7 3/25 as a decimal. "]}, {"subtopic": "Percentage", "patterns": ["Express 0.375 as a percentage. ", "The percentage of people who preferred to buy food on the way home from work was twice the percentage of people who gave other reasons. Find the percentage of people who gave other reasons. ", "She was given a 10% discount for both items.", "Find the percentage change in the temperature for Day 2. ", "What percentage of the area of C ls the area of R? "]}, {"subtopic": "Ratio", "patterns": ["The ratio of the area of Rectangle A to the shaded area of Rectangle A is 7:2. The ratio of the area of Rectangle B to the unshaded area of Rectangle B is 5:2. Find the ratio of the unshaded area of Rectangle A to the area of the whole figure.", "The ratio of Amal's money to Bill's money is 5:3. Amal spends 1/3 of her money. What is the new ratio of Bill's money to Amal's remaining money? ", "Figure 1 shows a rectangular piece of paper. The ratio of its length to its breadth is 4: 3. In Figure 2, the piece of paper is folded and cut along the dotted line. Figure 3 shows the cut-out, C, and the remaining area of paper, R.What is the ratio of the length to the breadth of C? "]}, {"subtopic": "Rate and Speed ", "patterns": ["Glen was 40 m away from home. He and his brother, John, were 10 m apart when they started running home at the same time. Glen ran at an average speed of 5 m/s while John, ran at an average speed of 8 m/s. What was the distance between the brothers when one of them reached home first? "]}, {"subtopic": "Algebra", "patterns": ["Matthew is thrice as old as his sister. In 5 years' time, their total age will be h years old. How old is his sister now? ", "Find the value of the following when k = 3. ", "In the equation below, the ones digits of the 2 numbers are not shown. The sum of the 2-digit numbers is 180. The difference between them is the greatest possible. What are the 2 numbers? ", "Tom and Jerry took a 10-minute Mathematics quiz. They started and ended the quiz at the same time. Tom answered 2 questions more than Jerry for every minute. Together, they answered 58 questions. How many questions did Jerry answer?", "Chandra bought 7 stamps at n cents each. He paid with a five-dollar note. How much change did he receive? "]}, {"subtopic": "Measurement", "patterns": ["Ali, Eddy, Gabriel and Harish wanted to try go-kart driving. The driver has to be taller than 1.4 m. Who is able to drive the go-kart?", "How many seconds are in 3/5 hour?"]}, {"subtopic": "Geometry", "patterns": ["Jeff is facing north. He makes a 1/4 turn clockwise followed by 1/2 turn anticlockwise. From here, he makes a final turn to face south-east. Find the angle that he has to make for the final turn.", "The square grid below shows the plan of a playground. What is the direction of the bench from the see-saw? ", "The location of the tree is to be north-west of the bench and south of the slide. Mark where the tree will be planted. ", "The toy car is south-west of the BLANK.", "In the figure, STU is a triangle. F, G and H are points on the triangle. SF = SG and UF = UH. Angle HFS = 104° and angle UFG = 106°. Find angle STU. ", "Which one of the following shapes has the greatest number of lines of symmetry? ", "Complete the following net of a cube such that it has one line of symmetry.", "Triangle ABC is an equilateral triangle. ABE and ACD are straight lines. BD = BE. Find the ratio of angle x to angle y to angle z. ", "In the figure, STU is a triangle. F, G and H are points on the triangle. SF = SG and UF = UH. Angle HFS = 104° and angle UFG = 106°. Find angle STU. ", "The figure below is not drawn to scale. Triangle BCE is an isosceles triangle. BC is parallel to AD. DCE is a straight line. ", "The figure below is not drawn to scale. Triangle BCE is an isosceles triangle. BC is parallel to AD. DCE is a straight line. ", "Match each net of solid to the correct solid formed.", "Which one of the following shows a net of a cube? ", "Complete the following net of a cube such that it has one line of symmetry."]}, {"subtopic": "Area and Volume", "patterns": ["The solid is made up of 2-cm cubes glued together as shown. It was painted in red on all sides. What is the area of one face of a cube? ", "The figure is made up of a circle and 2 squares. The circle touches each of the 2 squares as shown. Find the shaded area. ", "Find the perimeter of the shaded part ", "Which one of the triangles has an area of 12 cm2 ?", "Find the area of the shaded triangle. ", "Find the maximum number of 2 cm cubes that can be put into a box measuring 10 cm by 8 cm by 5 cm. ", "The figure shows an empty vase that is made from 2 containers. The bottom container is a cube of side 10 cm. The top container is a cuboid with a square base of 5 cm and a height of 25 cm. 1465 cm3 of water is poured into the empty vase, Find the height of the water level from the base of the vase. ", "Find the perimeter of the quarter circle. ", "The figure is made up of a circle and 2 squares. The circle touches each of the 2 squares as shown. Find the shaded area. ", "Two identical wheels with centres P and Q are 264 cm apart. After each wheel makes 6 complete turns, they touch each other. What is the radius of each wheel? Find the perimeter of the shaded part."]}, {"subtopic": "Data Representation and Interpretation", "patterns": ["The bar graph shows the reasons for people not using online food delivery platforms. The percentage of people who preferred to buy food on the way home from work was twice the percentage of people who gave other reasons. Find the percentage of people who gave other reasons. ", "The square grid below shows the plan of a playground. What is the direction of the bench from the see-saw? ", "Complete the bar graph to show the proportion of the amount of money collected for each brand of eggs in a week. Shade the bars.", "Study the table carefully. Which machine printed the most number of copies per minute?", "Tammy recorded the following temperatures for 2 days. Find the percentage change in the temperature for Day 2. ", "The line graph shows the amount of money Jackle spent from January to May. Find the increase in the amount of money spent between January and February. Between which 2 months was there the greatest increase in the amount of money Jackie spent? ", "The line graph shows the amount of water left In a water dispenser at the start of each day from Day 1 to 7. How much water ls left in the container at the end of Day 6? The amount of water dispensed for two days was the same. Which were the two days? What was the average amount of water dispensed from the start of Day 1 to the end of Day 5?", "The table shows some information on three brands of eggs. How much money was collected from the sale of the 3 brands of eggs in a week?"]}, {"subtopic": "Data Analysis", "patterns": ["The average age of 3 dogs was 12 years old. The age of each dog was different. The youngest dog was 8 years old. Which one of the following was a possible age of the oldest dog?", "What was the average number of words Fandi wrote per minute? ", "What was the average amount of water dispensed from the start of Day 1 to the end of Day 5?"]}]